app/controllers/artists_controller.rb

  def index
    @artists = Artist.all
---
SELECT "artists".* FROM "artists"

  def show
    @artist = Artist.find(params[:id])
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1]]