app/controllers/songs_controller.rb

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1]]
SELECT "songs".* FROM "songs" WHERE "songs"."artist_id" = ?  [["artist_id", 1]]
SELECT "songs".* FROM "songs"
---
  def index
    if params[:artist_id]
      if Artist.find_by(id: params[:artist_id]).nil?
      #  render template: 'artist/index'
        redirect_to '/artists', flash: { message: "Artist not found" }
      else
        @songs = Artist.find_by(id: params[:artist_id]).songs
      end
    else
      @songs = Song.all

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 2]]
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 1]]
SELECT  1 AS one FROM "songs" WHERE "songs"."artist_id" = ? AND "songs"."id" = ? LIMIT 1  [["artist_id", 1], ["id", 1]]
---
  def show
    if params[:artist_id]
      artist = Artist.find_by(id: params[:artist_id])
      song = Song.find_by(id: params[:song_id])
      if artist.songs.include?(song)